## Production: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cache_buster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cache_buster"  {
      ~ id      = "911250128" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # aws_cloudfront_distribution.wordpress will be updated in-place
  ~ resource "aws_cloudfront_distribution" "wordpress" {
        id                             = "E1HX1N6D5W92G9"
        tags                           = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          + response_headers_policy_id = (known after apply)
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }



        origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }


        # (7 unchanged blocks hidden)
    }

  # aws_cloudfront_response_headers_policy.security_headers_policy will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_policy" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "my-security-headers-policy"

      + security_headers_config {

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "SAMEORIGIN"
              + override     = true
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_iam_policy.cache_buster will be updated in-place
  ~ resource "aws_iam_policy" "cache_buster" {
        id        = "arn:aws:iam::472286471787:policy/cache_buster"
        name      = "cache_buster"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:ListInvalidations",
                          - "cloudfront:GetInvalidation",
                          - "cloudfront:GetDistributionConfig",
                          - "cloudfront:GetDistribution",
                          - "cloudfront:CreateInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.firehose_waf_log_bucket.aws_s3_bucket.this will be destroyed
  - resource "aws_s3_bucket" "this" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::platform-ircc-production-waf-logs" -> null
      - bucket                      = "platform-ircc-production-waf-logs" -> null
      - bucket_domain_name          = "platform-ircc-production-waf-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "platform-ircc-production-waf-logs.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "platform-ircc-production-waf-logs" -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "PlatformGCArticles"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "PlatformGCArticles"
          - "Terraform"  = "true"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.firehose_waf_log_bucket.aws_s3_bucket_public_access_block.this will be destroyed
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "platform-ircc-production-waf-logs" -> null
      - id                      = "platform-ircc-production-waf-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.wordpress_lb_logs.aws_s3_bucket.this will be destroyed
  - resource "aws_s3_bucket" "this" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::platform-ircc-production-lb-logs" -> null
      - bucket                      = "platform-ircc-production-lb-logs" -> null
      - bucket_domain_name          = "platform-ircc-production-lb-logs.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "platform-ircc-production-lb-logs.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "platform-ircc-production-lb-logs" -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "PlatformGCArticles"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "PlatformGCArticles"
          - "Terraform"  = "true"
        } -> null

      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "expire" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 30 -> null
              - expired_object_delete_marker = false -> null
            }
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.wordpress_lb_logs.aws_s3_bucket_public_access_block.this will be destroyed
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "platform-ircc-production-lb-logs" -> null
      - id                      = "platform-ircc-production-lb-logs" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

Plan: 1 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>